{"title": "Dyson V8 Origin+ Cordless Vacuum | Purple | New", "price": "$289.00", "company": "Dyson", "overall_rating": 4.4, "image": "https://m.media-amazon.com/images/I/51jz6WnkyaL._AC_SL1500_.jpg", "feature_bullets": null, "reviews": ["lasted for 1 year then stopped turning on. Worked great for 12 months.", "This vacuum is awful. It clogs so easily and when you empty it it works for a good 10 minutes before it is clogged again in another part of the vacuum. It was such a waste of money...just save yourself money and don't buy it.", "Dyson is like the Tesla of Vacuums. They look amazing and sound great upfront. Then you realize you can save a ton of money and get better results going with another brand. We've owned 3 or 4 in the Dyson stick line over the years and always end up disappointed. At this price point they should deliver on another level. Save time and headache and stick with the trusty Shark, hasn't failed us yet!", "Powerhead clearly does not work on this vacuum. I spent $400 on it. Called the manufacturer, hoping to get a replaced powerhead as I have had Dysons in the past and the powerheads always seem to go. I’ve had two replaced by myself purchasing them. The manufacturers phone number is US after waiting over half an hour on hold. I get told no I have a Canadian product with a serial number that’s Canadian. I said well before I get you off the line let’s check the serial Number, it was not a Canadian serial number. It’s a US serial number she put me on hold again not knowing how to deal with this. Came back on and told me I still need to call the Canadian line as she can do nothing to help me with this issue and I said, but your number is the one used as a manufacture, phone number and who to contact with issues. She didn’t really care that’s the phone number and that I am to call Canadian phone lines for Dyson and perhaps I shouldn’t have bought it off of Amazon and gone directly to a Dyson dealer??? I just want my Hedd replaced for the defective product I just bought", "This vacuum is terrible! Had it less than two weeks and already stopped working. The battery last less than 10-12 mins on high. And it's cheaply made. Such a disappointment. Sending back for full refund. Do your research before you purchase this.", "So simple to use and it has a charge and detachable feature so we can use it as a hand held vacuum and it fits in all the places! Best money I have spent on a Christmas present!", "I ordered a vacuum that arrived damaged and I returned it. I ordered the second vacuum and I’m happy to say it works great, and absolutely like how easy it is to use and how lightweight it is.l and very happy with the product", "Cleaning condo.", "I bought the v10 from Costco and returned it...it was heavy and no enough suction....the V8 is much lighter and more powerful and much cheaper", "It is good for everything."], "esg_scores": {"total": 30.61, "e_score": 6.0, "s_score": 15.39, "g_score": 9.22}, "openai_info": "The product is Dyson V8 Origin+ Cordless Vacuum | Purple | New from Dyson. It has an overall rating of 4.4 and costs $289.00 CAD. The features are as follows: None. The reviews are as follows: lasted for 1 year then stopped turning on. Worked great for 12 months., This vacuum is awful. It clogs so easily and when you empty it it works for a good 10 minutes before it is clogged again in another part of the vacuum. It was such a waste of money...just save yourself money and don't buy it., Dyson is like the Tesla of Vacuums. They look amazing and sound great upfront. Then you realize you can save a ton of money and get better results going with another brand. We've owned 3 or 4 in the Dyson stick line over the years and always end up disappointed. At this price point they should deliver on another level. Save time and headache and stick with the trusty Shark, hasn't failed us yet!, Powerhead clearly does not work on this vacuum. I spent $400 on it. Called the manufacturer, hoping to get a replaced powerhead as I have had Dysons in the past and the powerheads always seem to go. I’ve had two replaced by myself purchasing them. The manufacturers phone number is US after waiting over half an hour on hold. I get told no I have a Canadian product with a serial number that’s Canadian. I said well before I get you off the line let’s check the serial Number, it was not a Canadian serial number. It’s a US serial number she put me on hold again not knowing how to deal with this. Came back on and told me I still need to call the Canadian line as she can do nothing to help me with this issue and I said, but your number is the one used as a manufacture, phone number and who to contact with issues. She didn’t really care that’s the phone number and that I am to call Canadian phone lines for Dyson and perhaps I shouldn’t have bought it off of Amazon and gone directly to a Dyson dealer??? I just want my Hedd replaced for the defective product I just bought, This vacuum is terrible! Had it less than two weeks and already stopped working. The battery last less than 10-12 mins on high. And it's cheaply made. Such a disappointment. Sending back for full refund. Do your research before you purchase this., So simple to use and it has a charge and detachable feature so we can use it as a hand held vacuum and it fits in all the places! Best money I have spent on a Christmas present!, I ordered a vacuum that arrived damaged and I returned it. I ordered the second vacuum and I’m happy to say it works great, and absolutely like how easy it is to use and how lightweight it is.l and very happy with the product, Cleaning condo., I bought the v10 from Costco and returned it...it was heavy and no enough suction....the V8 is much lighter and more powerful and much cheaper, It is good for everything.. The company has an ESG score of 30.61 /40 and bigger number is worse."}